app/controllers/admin/v1/categories_controller.rb

SELECT "categories".* FROM "categories"
---
    def index
      @categories = Category.all

DELETE FROM "categories" WHERE "categories"."id" = $1  [["id", 369]]
---
    def destroy
      @category.destroy!

SELECT "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def load_category
      @category = Category.find(params[:id])

INSERT INTO "categories" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Category 01"], ["created_at", "2020-11-15 16:28:37.587368"], ["updated_at", "2020-11-15 16:28:37.587368"]]
UPDATE "categories" SET "id" = $1, "name" = $2, "updated_at" = $3 WHERE "categories"."id" = $4  [["id", 2], ["name", "Category renamed"], ["updated_at", "2020-11-15 16:29:48.878324"], ["id", 1]]
---
    def save_category!
      @category.save! # !, retorna um exceção caso ocorra um erro