app/controllers/admin/v1/coupons_controller.rb

    def index
      @loading_service = Admin::ModelLoadingService.new(Coupon.all, searchable_params)
---
SELECT "coupons".* FROM "coupons"

    def save_coupon!
      @coupon.save!
---
INSERT INTO "coupons" ("name", "code", "status", "discount_value", "max_use", "due_date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"